adaptiveMeshRefinement/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        0;
        relTol           0;
    };

    "(p_rgh|pcorr)"
    {
        solver              GAMG;
        tolerance           1e-6;
        relTol              0.01;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    };

    "(p_rghFinal|pcorrFinal)"
    {
        $p_rgh;
        tolerance           1e-6;
        relTol              0;
    };

    "(U|Yi|k|h)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.0;
    };

    UFinal
    {
        $U;
        tolerance       1e-7;
        relTol          0;
    };
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  3;
    nCorrectors       2;
    nNonOrthogonalCorrectors 1;
}

PISO
{
    momentumPredictor yes;
    nOuterCorrectors  3;
    nCorrectors       2;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    U                 1.0;
    "He|C3H6O|O2|N2"  1.0;       
}

// ************************************************************************* //
